{
  "backend/main.mo": "Motoko canister implementing scam report submission, storage, user queries, and scam-type statistics.",
  "feature_evidence.json": "JSON report describing implemented export‑related features, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of frontend file paths with brief descriptions of each component, page, hook, and script.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light/dark modes using OKLCH color tokens.",
  "frontend/index.html": "Basic HTML shell loading the React app via main.tsx into the root div.",
  "frontend/scripts/EXPORT_ARTIFACT.md": "Documentation describing export archive contents, formats, locations, and verification steps.",
  "frontend/scripts/export-source-code.ps1": "PowerShell script creating a ZIP archive of the full project including backend, frontend, and config files.",
  "frontend/scripts/export-source-code.sh": "Shell script creating a tar.gz archive of the full project including backend, frontend, and config files.",
  "frontend/SOURCE_CODE_EXPORT.md": "Guide explaining prerequisites, export steps, local setup, running the app, structure, and troubleshooting.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all app routes wrapped in AppLayout.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper providing navigation, main content area, and footer with Caffeine attribution.",
  "frontend/src/components/AppNav.tsx": "Responsive navigation header with desktop buttons and a mobile slide-out menu using router state to highlight active links.",
  "frontend/src/components/Branding.tsx": "Provides logo components including a standalone image and a combined logo-wordmark layout.",
  "frontend/src/components/ReportsDashboard.tsx": "Fetches and displays scam reporting statistics with loading and error states, including most common scam info.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, loading identities, handling login flow, and exposing identity state.",
  "frontend/src/hooks/useQueries.ts": "Defines hooks for fetching stats and submitting scam reports using the backend actor with React Query.",
  "frontend/src/index.css": "Configures Tailwind layers and custom CSS variables for light/dark themes and global styles.",
  "frontend/src/lib/riskDetector.ts": "Analyzes text for risk keywords to classify offers into low, medium, or high risk with explanations.",
  "frontend/src/lib/riskQuiz.ts": "Contains quiz questions and scoring logic to evaluate subscription-trap awareness and produce risk levels with explanations.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider wrappers.",
  "frontend/src/pages/BrowserExtensionConceptPage.tsx": "Static concept page describing a proposed browser extension with mockups and feature explanations.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, CTAs, and examples of common dark patterns.",
  "frontend/src/pages/PersonalDigitalRiskTestPage.tsx": "Interactive quiz page that calculates a digital vulnerability score and shows personalized tips.",
  "frontend/src/pages/ScamReportingPage.tsx": "Form page for submitting scam reports with success/error handling and a dashboard view.",
  "frontend/src/pages/SubscriptionTrapDetectorPage.tsx": "Tool page allowing users to paste offer text and receive automated subscription‑trap risk analysis.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, fonts, animations, and plugin setup.",
  "project_state.json": "Stores project metadata, architecture notes, and a list of defined features for the DarkPattern Shield prototype. Contains no code, only structured project planning data."
}