{
  "backend/main.mo": "Motoko canister implementing scam report storage, querying, and statistics with type definitions and scam-type comparison.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Text file listing high-level summaries of all major frontend source files.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables for light and dark mode themes.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/scripts/EXPORT_ARTIFACT.md": "Explains export archive contents, structure, formats, and script behavior for source code exports.",
  "frontend/scripts/export-source-code.ps1": "PowerShell script creating a full ZIP archive of the repository with staging and cleanup steps.",
  "frontend/scripts/export-source-code.sh": "Shell script generating a tar.gz source archive by staging and packaging project files.",
  "frontend/SOURCE_CODE_EXPORT.md": "Documentation guiding users through exporting, setting up, and running the project locally.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all app routes wrapped in AppLayout.",
  "frontend/src/components/AppLayout.tsx": "Layout component adding navigation, content container, and footer with Caffeine attribution.",
  "frontend/src/components/AppNav.tsx": "Responsive navigation bar with desktop buttons and a mobile sheet menu using router state to highlight active links.",
  "frontend/src/components/Branding.tsx": "Logo and wordmark components displaying the app’s branding.",
  "frontend/src/components/ReportsDashboard.tsx": "Dashboard card showing scam report stats with loading, error, and formatted data states.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages a backend actor tied to Internet Identity and invalidates queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for managing Internet Identity authentication and status.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching stats and submitting reports via the backend actor.",
  "frontend/src/index.css": "Tailwind base setup with custom light/dark theme variables and global styles.",
  "frontend/src/lib/riskDetector.ts": "Analyzes text for risk keywords and returns a risk level with detected indicators.",
  "frontend/src/lib/riskQuiz.ts": "Defines quiz questions and calculates a risk score and level based on user answers.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/BrowserExtensionConceptPage.tsx": "Concept page describing a future browser extension with detection, warning, and recommendation mockups.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, CTAs, and examples illustrating common digital dark patterns.",
  "frontend/src/pages/PersonalDigitalRiskTestPage.tsx": "Interactive quiz page that calculates a vulnerability score and displays personalized safety tips.",
  "frontend/src/pages/ScamReportingPage.tsx": "Form page for submitting scam reports with category selection, validation, and success/error states.",
  "frontend/src/pages/SubscriptionTrapDetectorPage.tsx": "Tool page allowing users to paste offer text and receive a risk analysis for subscription traps.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins for the project.",
  "project_state.json": "Contains project metadata, architectural decisions, and a list of implemented features for the DarkPattern Shield web app. Provides high-level build context including tech stack, logic constraints, and existing functionality."
}