{
  "kind": "build_request",
  "title": "Add top-level README.md for DarkPattern Shield project",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-13",
      "text": "Create a top-level `README.md` at the repository root that documents the DarkPattern Shield project in English, including: project overview, key features/pages, tech stack, prerequisites, local development setup (frontend + IC canister), how authentication works (Internet Identity), and how to export/download the full source code using the existing export scripts and docs.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "povide a readme file of this project"
        ]
      },
      "acceptanceCriteria": [
        "A `README.md` file exists at the repository root (same level as `backend/` and `frontend/`).",
        "README content is entirely English and written as end-user/developer documentation (not internal notes).",
        "README includes (at minimum) sections for: Overview, Features (with the existing pages: Home, Subscription Trap Detector, Personal Digital Risk Test, Scam Reporting + Dashboard, Browser Extension Concept), Tech Stack, Prerequisites (Node/pnpm/dfx), Local Development (install deps, run frontend, deploy canisters), Authentication (Internet Identity high-level flow), and Source Code Export (pointing to the existing `frontend/SOURCE_CODE_EXPORT.md` and mentioning the scripts in `frontend/scripts/`).",
        "README does not introduce any new product features beyond what is already implemented.",
        "README instructions align with the existing export behavior described by `frontend/SOURCE_CODE_EXPORT.md` and `frontend/scripts/export-source-code.sh` (including the `README_EXPORT.md` naming inside the export archive)."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, or anything in `frontend/src/components/ui`.",
    "Keep all backend logic in the existing single Motoko actor (no new backend services)."
  ],
  "nonGoals": [
    "Do not add a new in-app Tech Stack page unless explicitly requested.",
    "Do not change authentication behavior or add new sign-up/login UI beyond what already exists.",
    "Do not change the export scripts’ archive format/behavior beyond updating documentation references if needed."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}