{
  "kind": "build_request",
  "title": "Provide full project source code export package and export instructions",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-11",
      "text": "Produce an exportable, complete copy of the full project source code (backend and frontend) as a single downloadable package, ensuring it includes all files needed to build and run the app locally (including configuration files already present in the project).",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "export my full source code"
        ]
      },
      "acceptanceCriteria": [
        "A single downloadable source-code package is generated that contains the complete repository contents (e.g., backend/, frontend/, and any project config files that exist in the workspace).",
        "The exported package can be extracted without errors and preserves the folder structure and filenames.",
        "No source files are omitted from the export (including assets under frontend/public and any generated assets under frontend/public/assets/generated, if present)."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Add a top-level documentation file that explains how to obtain/export the full source code from the app/project workspace and how to run it locally, using only English user-facing text.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "export my full source code"
        ]
      },
      "acceptanceCriteria": [
        "A new top-level documentation file exists (for example, EXPORT.md or SOURCE_CODE_EXPORT.md).",
        "The documentation includes: prerequisites, local install steps for frontend, local deploy steps for the Motoko backend, and where to find the generated static assets.",
        "All documentation text is in English."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui or any other paths listed in frontend immutablePaths.",
    "Respect the single-actor Motoko backend architecture; keep all Motoko logic in backend/main.mo and only add backend/migration.mo if an upgrade requires it."
  ],
  "nonGoals": [
    "Do not implement an in-app runtime feature that zips/downloads the repository from within the deployed canister.",
    "Do not add third-party hosting/deployment integrations (GitHub, Vercel, Netlify, AWS, etc.)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}