{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add repository root README for DarkPattern Shield",
  "requirements": [
    {
      "id": "REQ-13",
      "summary": "Add an English, end-user/developer-facing root README.md covering project overview, existing pages/features, tech stack, prerequisites, local dev (frontend + IC canister), Internet Identity auth, and source-code export instructions aligned with existing export docs/scripts.",
      "acceptanceCriteria": [
        "A `README.md` file exists at the repository root (same level as `backend/` and `frontend/`).",
        "README content is entirely English and written as end-user/developer documentation (not internal notes).",
        "README includes (at minimum) sections for: Overview, Features (with the existing pages: Home, Subscription Trap Detector, Personal Digital Risk Test, Scam Reporting + Dashboard, Browser Extension Concept), Tech Stack, Prerequisites (Node/pnpm/dfx), Local Development (install deps, run frontend, deploy canisters), Authentication (Internet Identity high-level flow), and Source Code Export (pointing to the existing `frontend/SOURCE_CODE_EXPORT.md` and mentioning the scripts in `frontend/scripts/`).",
        "README does not introduce any new product features beyond what is already implemented.",
        "README instructions align with the existing export behavior described by `frontend/SOURCE_CODE_EXPORT.md` and `frontend/scripts/export-source-code.sh` (including the `README_EXPORT.md` naming inside the export archive)."
      ],
      "file_operations": [
        {
          "path": "README.md",
          "operation": "create",
          "description": "Create a repository-root README.md in English that documents DarkPattern Shield with sections: Overview; Features/Pages (Home, Subscription Trap Detector, Personal Digital Risk Test, Scam Reporting + Dashboard, Browser Extension Concept); Tech Stack; Prerequisites (Node.js, pnpm, dfx); Local Development (install dependencies, run frontend, deploy IC canisters); Authentication (Internet Identity high-level flow as implemented); Source Code Export (link to `frontend/SOURCE_CODE_EXPORT.md`, mention `frontend/scripts/export-source-code.sh` and `frontend/scripts/export-source-code.ps1`, and state that the export archive includes `README_EXPORT.md` copied from `frontend/SOURCE_CODE_EXPORT.md`). Ensure instructions do not claim any unimplemented features and match current export script behavior."
        }
      ]
    }
  ]
}